src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаДействияС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаДействияПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СоимостьЧасаРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/ВКМ_ФормированиеРТНаМесяц/Module.bsl
#Область  СлужебныеПроцедурыИФункции
Процедура ФормированиеДокументов(Параметры,Параметры1) Экспорт
	//В параметрах: Период, УИД
	
	//---//алгоритм должен выполняться с использованием механизма длительных операций БСП,
	
	//...это как? =)))
	
	//---//если Реализация за выбранный месяц уже создана, то обработка не должна создавать вторую,
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Владелец КАК Владелец,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты, 0) КАК ВКМ_СуммаАбонентскойПлаты,
	|	ДоговорыКонтрагентов.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_ДоговораДействующие
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|	И ДоговорыКонтрагентов.ВКМ_ДатаДействияС <= &КонецПериода
	|	И ДоговорыКонтрагентов.ВКМ_ДатаДействияПо >= &НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	ВТ_ДоговораДействующие КАК ВТ_ДоговораДействующие,
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	НЕ РеализацияТоваровУслуг.ПометкаУдаления
	|	И РеализацияТоваровУслуг.Договор В
	|			(ВЫБРАТЬ
	|				ВТ_ДоговораДействующие.Ссылка КАК Ссылка
	|			ИЗ
	|				ВТ_ДоговораДействующие КАК Договор)
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговораДействующие.Ссылка КАК СсылкаДОГ,
	|	ВТ_ДоговораДействующие.Владелец КАК ВладелецДОГ,
	|	ЕСТЬNULL(ВТ_ДоговораДействующие.ВКМ_СуммаАбонентскойПлаты, 0) КАК ВКМ_СуммаАбонентскойПлатыДОГ,
	|	ВТ_ДоговораДействующие.Организация КАК ОрганизацияДОГ,
	|	ВТ_Реализации.Ссылка КАК СсылкаРТ
	|ИЗ
	|	ВТ_ДоговораДействующие КАК ВТ_ДоговораДействующие
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
	|		ПО ВТ_ДоговораДействующие.Ссылка = ВТ_Реализации.Договор";
	
	// 01++
	Период = Параметры.Период;
	КонецПериода = КонецМесяца(Период);
	НачалоПериода = НачалоМесяца(Период);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	// 02++
	Выгрузка = РезультатЗапроса.Выгрузить();
	ВсегоДокументов = Выгрузка.Количество();
	ТекДок = 1;
	
	ТЗнч = Новый ТаблицаЗначений;
	//ТЗнчДК = Тип("СправочникСсылка.ДоговорыКонтрагентов");
	//ТЗнчРТ = Тип("ДокументСсылка.РеализацияТоваровУслуг");
	ОпТДК = Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов");
	ОпТРТ = Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг");
	ТЗнч.Колонки.Добавить("Договор",ОпТДК);
	ТЗнч.Колонки.Добавить("Документ",ОпТРТ);
	
	Пока Выборка.Следующий() Цикл
		
		Договор = Выборка.СсылкаДОГ;
		Владелец = Выборка.ВладелецДОГ;
		Организация = Выборка.ОрганизацияДОГ;
		СсылкаРТ = Выборка.СсылкаРТ;
		
		СтрокаТЗнч = ТЗнч.Добавить();
		СтрокаТЗнч.Договор = Договор;
		
		ШапкаСтруктура = Новый Структура;
		ШапкаСтруктура.Вставить("Контрагент",Владелец);
		ШапкаСтруктура.Вставить("Организация",Организация);
		ШапкаСтруктура.Вставить("Договор",Договор);
		ШапкаСтруктура.Вставить("СсылкаРТ",СсылкаРТ);
		ШапкаСтруктура.Вставить("Дата",КонецПериода);
		ШапкаСтруктура.Вставить("Период",Период);
		РеализацияТоваров = СоздатьДокуметРТПоДоговору(ШапкаСтруктура);
		
		Если РеализацияТоваров <> Неопределено Тогда
			СтрокаТЗнч.Документ = РеализацияТоваров;
		Иначе
			Продолжить
		КонецЕсли;
		
		ПроцентВыполнения = (ТекДок/ВсегоДокументов)*100;
		ПроцентВыполнения = Окр(ПроцентВыполнения,0);
		ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения,СокрЛП(РеализацияТоваров),);
		
		ТекДок = ТекДок + 1;
	КонецЦикла; 
	//УИД = Параметры.УИД;
	//НовАдресВХ = ПоместитьВоВременноеХранилище(ТЗнч,Параметры.ТЗнчРезультатыАдресВХ);
	
КонецПроцедуры      

//---//при создании Реализации необходимо вызывать стандартный алгоритм заполнения,

Функция СоздатьДокуметРТПоДоговору(ШапкаСтруктура);
	
	СсылкаРТ = ШапкаСтруктура.СсылкаРТ;
	// ....если Реализация за выбранный месяц уже создана, то обработка не должна создавать вторую
	Создать = Ложь;
	Если НЕ ЗначениеЗаполнено(СсылкаРТ) ИЛИ СсылкаРТ = Null Тогда
		Создать = Истина;
	КонецЕсли;
	
	Если Создать Тогда
		Документ = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(Документ,ШапкаСтруктура); 
		Документ.Комментарий = СтрШаблон("Создан по договору %1 за %2.",ШапкаСтруктура.Договор, Формат(ШапкаСтруктура.Период,"ДФ='MMMM yyyy ''г.'''"));
	Иначе
		Документ = СсылкаРТ.ПолучитьОбъект();
	КонецЕсли;
	
	//---//для заполнения Реализации необходимо использовать метод модуля объекта Реализации ВыполнитьАвтозаполнение,
	Документ.ВКМ_ВыполнитьАвтозаполнение(Документ);
	СтоитПроводить = Ложь;
	СуммаДокумента = Документ.СуммаДокумента; 
	Если СуммаДокумента > 0 Тогда
		СтоитПроводить = Истина;
		Документ.Записать();
	КонецЕсли;
	;
	
	Если Документ.ПроверитьЗаполнение() И СтоитПроводить Тогда
		Документ.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		СообщениеПоДок = Новый СообщениеПользователю;
		Если СтоитПроводить Тогда
			СообщениеПоДок.Текст = СтрШаблон("Документ %1, НЕ проведен! т.к. не прошел проверку заполнения.",Документ);
			СообщениеПоДок.Сообщить();
		ИначеЕсли НЕ СтоитПроводить И СуммаДокумента <= 0 Тогда
			СообщениеПоДок.Текст = СтрШаблон("Документ %1, НЕ проведен! т.к. сумма документа не корректна.",Документ);
			СообщениеПоДок.Сообщить();
		КонецЕсли;
	КонецЕсли;
	Возврат Документ.Ссылка;
	
КонецФункции
#КонецОбласти
